/**
 * Created by Ярик on 24.09.2016.
 */
"use strict";

$(document).ready(function () {
    /*
     Реализуем корзину в магазине

     подключить класс корзины к сайту*/

    /* создать обработчики нажатия на кнопки Add to cart с добавлением товара в корзину */


    /* при загрузке главной страницы выводить в шапке сайта кол-во товаров в корзине и общую сумму */


    /* при загрузке страницы корзины cart.html вывести список товаров из корзины по верстке существующего списка */


    /* реализовать изменение кол-ва товара в корзине по кнопкам + и - на странице корзины и добавить автоматическое
     изменение суммы при этом, как в строке так и общей суммы корзины */


    /* реализовать удаление товара из корзины по кнопке х

     - для корректного отображения товаров в списке объект товара должен хранить url картинки.
     */


});
